#ifndef __DH11_H_
#define __DH11_H_

/**********************************
包含头文件
**********************************/
#include "public.h"
#include "reg51.h"

/**********************************
PIN口定义
**********************************/
sbit Data=P1^0;				//定义DH11数据线

extern uchar wen_dat[16];   	//用于显示温湿度的接收数据数组

/**********************************
函数声明
**********************************/
/*DH11初始化函数*/
void DHT11_start(void);
/*DH11接受一个字节函数*/
uchar DHT11_rec_byte(void);
/*DH11接受40位数据函数*/
void DHT11_receive(void);					  

#endif

