#include "dh11.h"
uchar wen_dat[16];   	//用于显示温湿度的接收数据数组
/****************************************************************************
*函数名：DHT11_rec_byte
*输  入：无
*输  出：无
*功  能：DH11初始化
****************************************************************************/
void DHT11_start()
{
   Data=1;
   Delay_us(2);
   Data=0;
   Delay_ms(20);   //延时18ms以上
   Data=1;
   Delay_us(30);
}

/****************************************************************************
*函数名：DHT11_rec_byte
*输  入：无
*输  出：dat:一个字节的数据
*功  能：接收一个字节
****************************************************************************/
uchar DHT11_rec_byte()      
{
   uchar i,dat=0;
	 for(i=0;i<8;i++)    //从高到低依次接收8位数据
   {          
      while(!Data);   //等待50us低电平过去
      Delay_us(8);     //延时60us，如果还为高则数据为1，否则为0 
      dat<<=1;           //移位使正确接收8位数据，数据为0时直接移位
      if(Data==1)    //数据为1时，使dat加1来接收数据1
         dat+=1;
      while(Data);  //等待数据线拉低    
    }  
    return dat;
}

/****************************************************************************
*函数名：DHT11_receive
*输  入：无
*输  出：无
*功  能：接收40位的数据
****************************************************************************/
void DHT11_receive()      
{
	uchar R_H,R_L,T_H,T_L,RH,RL,TH,TL,revise; 
	DHT11_start();
	if(Data==0)
	{
		while(Data==0);   //等待拉高     
		Delay_us(40);  //拉高后延时80us
		R_H=DHT11_rec_byte();    //接收湿度高八位  
		R_L=DHT11_rec_byte();    //接收湿度低八位  
		T_H=DHT11_rec_byte();    //接收温度高八位  
		T_L=DHT11_rec_byte();    //接收温度低八位
		revise=DHT11_rec_byte(); //接收校正位

		Delay_us(25);    //结束

		if((R_H+R_L+T_H+T_L)==revise)      //校正
		{
			RH=R_H;
			RL=R_L;
			TH=T_H;
			TL=T_L;
		} 
        /*数据处理，方便显示*/
				wen_dat[0]='S';
				wen_dat[1]='h';
				wen_dat[2]='i';
				wen_dat[3]=':';
        wen_dat[4]='0'+(RH/10);
        wen_dat[5]='0'+(RH%10);
        wen_dat[6]='R';
        wen_dat[7]='H';
				wen_dat[8]=' ';
				wen_dat[9]='T';
				wen_dat[10]='e';
        wen_dat[11]='m';
        wen_dat[12]=':';
        wen_dat[13]='0'+(TH/10);
        wen_dat[14]='0'+(TH%10);
        wen_dat[15]='C';

	}
}