#include "esp8266.h"
uchar dat_8266[]="#00#00#00#";		//用于储存上传云平台的数据
/****************************************************************************
*函数名：ESP8266dat
*输  入：无
*输  出：无
*功  能：8266数据处理函数
****************************************************************************/
void ESP8266dat(void)
{
		//ESP8266数据处理
		dat_8266[0]=wen_dat[4];		//湿度数据
	  dat_8266[1]=wen_dat[5];
		dat_8266[2]='#';
		dat_8266[3]=wen_dat[13];	//温度数据
		dat_8266[4]=wen_dat[14];
		dat_8266[5]='#';
		dat_8266[6]=yanwu_dat[4];	//MQ2数据
		dat_8266[7]=yanwu_dat[5]; 
}